import React, { FC } from 'react';
import './About.scss';

interface AboutProps { }

const About: FC<AboutProps> = () => (
  <div className="About">
    <h1>...אודותינו</h1>
    <div className="library-description">

      <p>הספרייה העירונית היא מוסד תרבותי חשוב המשרת את הקהילה המקומית במגוון תחומים. הספרייה מספקת גישה חופשית למאגרי ידע רחבים הכוללים ספרים, כתבי עת, עיתונים, ומשאבים דיגיטליים.</p>
      <p>בנוסף, היא מציעה פעילויות תרבותיות וחינוכיות כגון סדנאות, הרצאות, מועדוני קריאה, ותכניות מיוחדות לילדים ונוער. הספרייה משמשת כמקום מפגש חברתי וקהילתי, ומקדמת אוריינות ושוויון הזדמנויות לכלל האוכלוסייה.</p>
      <p>בעידן הדיגיטלי, הספרייה גם מתאימה את עצמה לצרכים המשתנים של הציבור באמצעות פלטפורמות מקוונות ושירותים דיגיטליים.</p>
    </div>
    <h3 style={{textAlign:"center",color:"#0056b3",marginTop:"2%"}}>!שתדעי שאת חלק משליחות</h3>
  </div>
);

export default About;
